{
    "data": {
        "switch": "switch",
        "articleTitle": "AlphaGo won Ke Jie, but why by 1/4?",
        "articleContent": "Ke Jie lost, unexpectedly.\nLooking back at the end of last year, December 29, a man named Master's Go Artificial Intelligence turned out, before and after the chess chess and wild fox chess and the world's top players in the game, and finally to 60: 0 overwhelming record Chess question life, the only draw is also because the Master opponent accidentally disconnect the network connection. And this invincible Master is actually Google artificial intelligence team Deepmind research and development of AlphaGo new version 2.0.\nAs early as March 2016, Go Artificial AlphaGo has been 4: 1 victory over South Korea's first player Liu Shishi. Before the game, Li Shishi confident, after the game, Li Shishi said he did not want to play with AlphaGo no longer. Some people joke, 'uniform Master (AlphaGo) the only way is to unplug the power.' Dumbfounded, behind the joke is a deep fear of artificial intelligence.\n\nHowever, do not forget that AlphaGo is from the hands of mankind.\nAlpha wins at the end of last year's victory over Li Shishi and Alpha Go has reached a very high level of effort, at least its computing power and speed to make people catch up.\nLast year's AlphaGo2.0, the use of neural network system to simulate the human brain neural network, has not only a supercomputer, but also by a number of data centers as nodes connected, each node has multiple supercomputers. In one sentence, AlphaGo is a collection of complex control, the algorithm as one of the artificial intelligence.\n\nThe complexity of Go\nThe most basic system of AlphaGo is Convolutional Neural Network (CNN). As the law of the Go can be described as 'the two sides of the game at the intersection of the checkerboard grid placed alternately black and white pieces .After the child is finished, the pawn can not move the game in the process of eating around the ground to the ' Decided to win or lose. 'CNN is used to identify the image.\n\nIn addition to highly efficient convolution neural networks, Deep Q-Learning (DQN) and Monte Carlo Tree Search are also the core algorithms for AlphaGo.\nThe Monte Carlo tree search algorithm is a method of making optimal decisions in artificial intelligence problems. It is usually the form of move planning in combinatorial game, which combines the generalness of random simulation and the accuracy of tree search. In the words of words, AlphaGo simulates himself and his own chess, every kind of lodging down to the end, in a very short period of time exhausted all the circumstances, so as to obtain the winning probability. With the help of the value network and the policy network, a large number of selection points are evaluated by the value network, and the placement is selected through the policy network.\n\nThe so-called depth of reinforcement learning means that AlphaGo can remember and learn 30 million human chess, to identify the number of players with the game, including the ability to self-learning, that is, every day against 20 million, to This is the so-called 'chess', and in the game quickly determine the situation of Go. This greatly reduces the amount of tree search calculation.\n\nAlphaGo self chess game\nIn short, the ability to sweep the World Cup AlphaGo2.0 computing capacity, the overall situation are super, and will not be the slightest human chess in the game of psychological and physiological changes in the impact, no emotional, only rational to the cold algorithm and logic The\nEven so, AlphaGo has also been in the hands of Li Shishi off a Board. That Ke Jie may win it? Ke Jie today has lost a game, want to win in the next game, visual probability is zero.\n\nLi Shishi and AlphaGo game in the fourth inning, AlphaGo loopholes\nThis time, it is said that AlphaGo's chess force more, you can do in the case of the previous generation AlphaGo four children still win, you know, usually speaking to the three son has reached the level of the difference. Wang Xiaochuan that this time AlphaGo has been out of the supervision of learning, no longer need human history of the next Go, but only through the 'enhanced learning' and the algorithm to determine Lazi. According to Google public information, Wang Xiaochuan speculated that the AlphaGo may have given up the supervision of learning, that is no longer dependent on the original human 30 million Bureau of the game, and may even give up the Monte Carlo tree search, greatly reducing the violence, Lift faster, more accurate rate. AlphaGo with no chess data to learn how to play chess, and reached the pinnacle of the point, only a week's time.\nIf the previous AlphaGo also depends on a lot of data, a little cumbersome calculation, which is artificial intelligence to occupy the advantages of hardware, then the evolution of the AlphaGo almost like a genius really know the art of Go.\n\nIn March this year, artificial intelligence in Texas poker field also won the victory. Matej Morav ík of the Department of Computer Science at the University of Alberta in Canada has developed an AI system called DeepStack that has historically defeated 10 of 11 professional poker players after every 3,000 Unlimited Texas Hold'em games. Compared to Go, the unique composition of Texas Hold'em is on the board, and the player gets complete information, but each player in the poker game has asymmetric information about the possible games. This indicates that AI is on the predictability of another progress.\n\nArtificial intelligence progress again and again, can not help but let us start self-reflection. Even if AlphaGo hit the world invincible hand, Go is only the corner of human wisdom, we can not say that the current artificial intelligence beyond the human. However, we should reflect on whether human beings have been blindly superstitious because of their lack of knowledge of their own wisdom, and concluded that human thinking is inextricably high, and there seems to be a fundamental gap between mankind and man-machine. Can I overestimate myself as a kind of arrogance?\nThere may be a more positive relationship between human and artificial intelligence: letting humans further understand themselves through AI.\n\nBefore the expedition, the media called the war 'man-made final decisive battle,' Ke Jie said he holding the 'winning attitude, the determination of death,' a great shoulder to shoulder the dignity of all human dignity. In fact, Kejie no need to tangle, this war is the brain and the more advanced human brain confrontation.\nAnd today the end of the first game, AlphaGo won, but only win over Keji 1/4, compared to last year to hit the opponent no room to counterattack, today's AlphaGo seems to have a little human, seems to become more tolerant, Manpower strength comparable to the illusion. Why did the upgraded AlphaGo win only 1/4? what does this mean?\nAlphaGo may have been fully aware of Ke Qi's chess path, 1/4 is the intention to calculate the results; may AlphaGo occurred self-evolution, resulting in another new chess ideas ; May Ke Jie found the new game under Go ...\nAbove is my guess and imagination, what are you new ideas?"
    }
}