{
    "data": {
        "switch": "cambiar",
        "articleTitle": "AlphaGo realmente ganó Ke Jie, pero ¿por qué es como 1/4?",
        "articleContent": "Ke Jie perdió, que se espera.\nTiempo atrás, al final de 29 de diciembre del año pasado, un hombre llamado Maestro de Go AI resultado, antes y después de los partidos en el sitio con los mejores jugadores de la ciudad nacional de ajedrez Go Go y Wildfox del mundo, y finalmente a 60: 0 de tener que dar registro abrumadora Dan cuestión de la vida, la única vez que el sorteo es inesperado porque el rival principal desconecta de la red. Y esto invencible Maestro Google es en realidad la investigación de inteligencia artificial y el equipo de desarrollo Deepmind nueva versión 2.0 AlphaGo.\n\nYa en marzo de 2016, tuvo que ir artificial AlphaGo inteligencia 4: Ir golpeado Corea primera mano Li Shishi 1. Antes del partido, Li Shishi confianza después del partido Li Shishi, dijo que ya no quería AlphaGo jugar al ajedrez. Era una broma, 'el único método uniformes Maestro (AlphaGo) es desenchufar el poder'. Reír, detrás de esta broma es un miedo profundo de la inteligencia artificial.\n\nSin embargo, no se olvide, AlphaGo es de la mano del hombre.\nla victoria de Li Shishi durante el año pasado, así como un público Kathrine Ir AlphaGo ha alcanzado una resistencia muy alta de juego, al menos, su potencia de cálculo y velocidad hacen que el polvo humano.\nAlphaGo2.0 del año pasado, el uso de redes neuronales simular la red neural del cerebro humano, tiene no sólo un superordenador, y se compone de muchos centros de datos están conectados como nodos, más de un superordenador dentro de cada nodo. Se resume en una frase es, AlphaGo es una variedad de algoritmos de control complejos para la integración de la inteligencia artificial.\n\nLa complejidad de ajedrez\nAlphaGo sistema más básico es la red neuronal de convolución (convolucional de redes neuronales, CNN). Dado que la ley de Go se puede describir como 'lados del ajedrez puestas alternativamente en la intersección de las piezas de la rejilla de tablero de ajedrez blanco y negro. Después de la finalización de zi, las piezas no se pueden mover. Niño de ajedrez para comer durante circunferencia a la circunferencia 'a' tamaño para determinar el ganador. 'CNN y se utiliza para identificar la imagen.\n\nAdemás de la alta eficiencia de reconocimiento de red neuronal de convolución de la profundidad del aprendizaje por refuerzo (Deep Q-Learning, DQN) y Monte Carlo árbol de búsqueda de algoritmos (Monte Carlo árbol de búsqueda) algoritmo es el núcleo de AlphaGo.\nMonte Carlo algoritmo de búsqueda de árbol es un método de inteligencia artificial para tomar decisiones óptimas en cuestión, por lo general una combinación de acciones en el juego (mover) en forma de planificación que combina la precisión de la simulación estocástica de la búsqueda general y el árbol. El empleo de las palabras es, ajedrez analógico AlphaGo consigo mismo, cada uno de los cuales se han reducido a la final Lazi, agota todos los casos en un período muy corto de tiempo, para obtener la probabilidad de ganar. Con ambos profundidad red neural red de valor (red de valor) y la estrategia de red (red de políticas), para evaluar el valor de un gran número de puntos seleccionados a través de la red, y la política de selección de red mediante la colocación.\n\nLa profundidad de la llamada aprendizaje por refuerzo refiere AlphaGo sea capaz de aprender y recordar 30 millones de ajedrez humano, para identificar los grandes aquellos con los que los jugadores juegan en contra, incluyendo la capacidad de auto-aprendizaje, es decir, auto-innings frente a 20 millones de dólares al día para esto obtener el llamado 'sentido de ajedrez', y rápidamente determinar la situación en el juego de Go. Tal acción podría reducir significativamente la cantidad de cálculo de árbol de búsqueda.\n\nAlphaGo de ajedrez juego de ajedrez auto\nCon todo, barrió las AlphaGo2.0 ajedrez mundial potencia de cálculo, el cuadro más grande es estupendo, y no se verá afectada por la psicología humana se produjo en términos de juego de ajedrez financiera, los cambios fisiológicos, no emocional, sólo algoritmos racionales y lógicos al frío .\nAun así, también AlphaGo sido doblado sobre un juego en manos de Li Shishi. Ke Jie que podría ganar? Ke Jie hoy ha perdido un partido, que desea ganar el próximo partido, visualmente probabilidad cero.\n\nLi Shishi y AlphaGo ajedrez cuarta entrada, lagunas AlphaGo\nEsta vez, se dice AlphaGo más por pensar en profundidad, todavía se puede hacer para ganar en el cuarto hijo de generaciones anteriores AlphaGo caso, usted sabe, en términos generales vamos tres hijos se habían alcanzado en nombre de los pobres nivel. Sra. Yu cree que esta vez el AlphaGo ha estado fuera de aprendizaje supervisado, ya no tendrá que pasar por debajo de los datos históricos humanos, pero sólo 'aprendizaje por refuerzo' y a través del algoritmo determina Lazi. Según Google la información a disposición del público, la Sra Yu especula que esto puede haber renunciado a AlphaGo aprendizaje supervisado, que ya no depende de la oficina de ajedrez humano original de 30 millones de dólares, incluso puede renunciar a la Monte Carlo árbol de búsqueda, lo que reduce en gran medida la computación de la violencia, lazi más rápido, una mayor precisión. Dos no juega contra el juego de datos de registro AlphaGo auto-aprender a jugar al ajedrez, y alcanzó el punto de culminación, el tiempo sólo una semana.\nSi antes de la AlphaGo también depende de una gran cantidad de datos y un poco en el cómputo pesada, la inteligencia artificial, que está ocupado por las ventajas de hardware de ubicación, por lo AlphaGo la evolución es casi como una verdadera van bien versados ​​en el arte del genio.\n\nEn marzo de este año, el campo de la inteligencia artificial de póquer en Texas también ganó la victoria. Matej Departamento de Ciencias de la Computación de la Universidad de Alberta Morav IK desarrollado sistema de inteligencia artificial se llama DeepStack, que después de cada 3.000 Limit Hold'em torneo, después de haber golpeado a un estadísticamente significativas 10 11 jugadores profesionales de póquer en. En comparación con Ir, Texas Hold'em ingredientes desconocidos más, los jugadores tienen en el tablero está lleno de información, pero en un juego de póquer cada jugador tiene una información limitada sobre el posible modo de juego asimétrico. Esto indica que el progreso en la IA y otra vez en la previsibilidad.\n\nAI y otra vez el progreso, que no puede dejar de comenzar el autoexamen. Incluso AlphaGo inmejorable, Go es única sabiduría humana del iceberg, no podemos decir que en la actualidad es mucho más allá de la inteligencia artificial humana. Sin embargo, debemos reflexionar sobre si los seres humanos han sido a causa de su falta de conocimiento y sabiduría a su vez producen ciega superstición, y no la conclusión de que la mente humana tiene una altura, parece que se extiende la brecha entre aquí y el tipo de la naturaleza humana. Le pido a la gente a sobreestimar su ciega, entendida como un arrogante que?\nLa inteligencia humana y artificial que puede haber una relación más positiva: Con AI hacer aún más la comprensión humana de los suyos.\n\nAntes de subir al avión, los medios de comunicación han puesto esta guerra se llama 'batalla final hombre-máquina,' Ke Jie dijo que adhería a la 'actitud ganadora y determinación para morir', una especie de gran sabor dignidad de todos los seres humanos a hombro. De hecho, Ke Jie no tiene que enredarse, pero esta guerra es más avanzado es el cerebro humano y el cerebro humano enfrentamiento nada.\nEl primer juego terminó hoy, AlphaGo ganó, pero sólo ganar más de un cuarto de la sub-Ke Jie, en comparación con los oponentes de golpe del año pasado no había espacio para contraatacar, con el punto de AlphaGo de hoy parece impersonal, parece tener mucha tolerancia, para producir una ilusión de la fuerza humana comparable. ¿Por qué actualizado AlphaGo pero ganó sólo una cuarta parte como? ¿Qué significa esto?\nAlphaGo posible alza, ganando a mejorar, pero disminución de ajedrez; AlphaGo puede haber sido plenamente consciente de la forma de ajedrez Ke Jie, 1/4 resultados se calcula deliberadamente; puede AlphaGo ocurrió auto-evolución, lo que resulta en otro nuevas ideas de ajedrez sino que pueden ser encontrados Ke Jie Weiqi nueva desmontar ......\nEstos son mi especulación y la imaginación, nuevas ideas así que lo que hacen?"
    }
}