{
    "dateFormat": "dd/MM/yyyy",
    "data": {
        "switch": "commutateur",
        "articleTitle": "AlphaGo a vraiment gagné Ke Jie, mais pourquoi est-1/4 comme?",
        "articleContent": "Ke Jie a perdu, attendu.\nRetour à la fin du 29 Décembre l'année dernière, un homme nommé Maître de Go AI tourné, avant et après les matchs sur le site avec les meilleurs joueurs de la ville d'échecs nationaux Go Go et Wildfox monde, et enfin à 60: 0 de devoir donner dossier accablant dan question de la vie, la seule fois que le tirage au sort est inattendu, car rival master déconnecté du réseau. Et ce maître invincible Google est en fait la recherche en intelligence artificielle et de l'équipe de développement Deepmind nouvelle version 2.0 AlphaGo.\n\nDès Mars 2016, a dû aller l'intelligence artificielle AlphaGo 4: Allez battu la Corée première main Li Shishi 1. Avant le match, la confiance Li Shishi après le match Li Shishi, a dit qu'il ne voulait plus AlphaGo jouer aux échecs. Il était une blague, « les uniformes que la méthode maître (AlphaGo) est de débrancher l'alimentation. » Rire, derrière cette plaisanterie est une peur profonde de l'intelligence artificielle.\n\nCependant, ne pas oublier, AlphaGo est de la main de l'homme.\nLi Shishi victoire sur la fin de l'année dernière, ainsi qu'un Kathrine Go AlphaGo publique a atteint un très haut niveau de jeu, au moins sa puissance de calcul et la vitesse font la poussière humaine.\nAlphaGo2.0 l'an dernier, l'utilisation des réseaux de neurones simulent le réseau de neurones du cerveau humain, a non seulement un super-ordinateur, et est composé de nombreux centres de données sont connectées en tant que noeuds, plus d'un supercalculateur à l'intérieur de chaque nœud. Résumer en une phrase est, AlphaGo est une variété d'algorithmes complexes de contrôle pour l'intégration de l'intelligence artificielle.\n\nLa complexité d'échecs\nAlphaGo système le plus élémentaire est le réseau de neurones de convolution (Convolutif Neural Network, CNN). Depuis la loi de Go peut être décrit comme « parties d'échecs placés en alternance à l'intersection des morceaux de grille en damier noir et blanc. Après l'achèvement de zi, les pièces ne peuvent pas être déplacés. Enfants d'échecs à manger pendant la circonférence à la circonférence « à » taille pour déterminer le gagnant. « et CNN est utilisé pour identifier l'image.\n\nEn plus de la grande efficacité de la reconnaissance du réseau neural de convolution de la profondeur de l'apprentissage par renforcement (Deep Q-Learning, DQN) et Monte Carlo arbre algorithmes de recherche algorithme (Monte Carlo Recherche de référence) est le noyau de AlphaGo.\nalgorithme de recherche arborescente Monte Carlo est une méthode d'intelligence artificielle pour prendre des décisions optimales en question, généralement une combinaison d'actions dans le jeu (mouvement) sous la forme de planification qui combine la précision de la simulation stochastique de la recherche générale et arbre. L'emploi des mots est, chacun d'échecs analogique AlphaGo avec lui-même, sont en baisse à Lazes finale, épuiser tous les cas une très courte période de temps, pour obtenir la probabilité de gagner. À la fois la profondeur réseau de valeur du réseau de neurones (réseau de valeur) et de la stratégie de réseau (réseau politique), d'évaluer la valeur d'un grand nombre de points sélectionnés par le réseau, et la politique de sélection du réseau par le placement.\n\nLa profondeur de la soi-disant apprentissage de renforcement fait référence AlphaGo être en mesure d'apprendre et de se rappeler 30 millions d'échecs humains, d'identifier les grandes avec laquelle les joueurs jouent contre, y compris la capacité d'auto-apprentissage, qui est auto-tours de batte contre 20 millions par jour pour cette obtenir que l'on appelle le « sens d'échecs », et déterminer rapidement la situation dans le jeu de Go. Une telle action permettrait de réduire considérablement la quantité de calcul recherche d'arbre.\n\nAlphaGo jeu d'échecs auto d'échecs\nDans l'ensemble, a balayé les AlphaGo2.0 d'échecs du monde la puissance de calcul, plus l'image sont super, et ne sera pas affectée par la psychologie humaine ne s'en termes de jeu d'échecs financiers, les changements physiologiques, et non émotionnelle, seulement des algorithmes rationnels et logiques à froid .\nMême si, AlphaGo également replié sur un jeu entre les mains de Li Shishi. Ce Ke Jie pourrait gagner? Ke Jie aujourd'hui a perdu un match, vous voulez gagner le prochain match, visuellement une probabilité nulle.\n\nLi Shishi et les échecs AlphaGo quatrième manche, les failles AlphaGo\nCette fois-ci, il est dit AlphaGo plus en pensant profondeur, vous pouvez encore gagner dans le quatrième fils des générations précédentes AlphaGo cas, vous savez, en général nous trois fils avaient été conclus au nom du faible niveau. Mme Yu croit que cette fois la AlphaGo a été hors de l'apprentissage supervisé, plus besoin d'aller dans les données historiques de l'homme, mais seulement « l'apprentissage par renforcement » et par l'algorithme détermine Lazi. Selon Google informations disponibles publiquement, Mme Yu a spéculé que cela peut avoir abandonné l'apprentissage supervisé AlphaGo, qui ne dépend plus du bureau d'échecs humains 30 millions d'origine, il peut même renoncer à Monte Carlo arbre de recherche, ce qui réduit considérablement le calcul de la violence, plus rapide Lazes, une plus grande précision. Deux n'a pas joué contre les données d'enregistrement jeu AlphaGo auto-apprendre à jouer aux échecs, et atteint le point culminant, juste le temps d'une semaine.\nSi, avant la AlphaGo dépend aussi beaucoup de données et un peu sur le calcul lourd, l'intelligence artificielle, qui est occupé par les avantages matériels de localisation, de sorte AlphaGo l'évolution est presque comme un vrai go très versé dans l'art du génie.\n\nEn Mars de cette année, le domaine du poker d'intelligence artificielle au Texas a également remporté la victoire. Matej Morav Département de l'Université de l'Alberta Computer Science ik a développé le système AI est appelé DeepStack, qui, après chaque 3000 Limit Hold « em tournoi, après avoir battu un joueur statistiquement significatifs 10 11 de poker professionnels. Par rapport à Go, Texas Hold'em ingrédients inconnus plus, les joueurs sur la carte est plein d'informations, mais dans un jeu de poker, chaque joueur a peu d'informations sur le gameplay asymétrique possible. Cela indique que les progrès dans AI et encore sur la prévisibilité.\n\nAI progrès encore et encore, nous ne pouvons pas aider mais commencer à l'auto-examen. Même AlphaGo imbattable, Go est que la sagesse humaine de l'iceberg, nous ne pouvons pas dire à l'heure actuelle est bien au-delà de l'intelligence artificielle humaine. Cependant, nous devrions réfléchir à savoir si les humains ont été en raison de leur manque de connaissances et de sagesse à son tour produire superstition aveugle, et pas en conclure que l'esprit humain a une hauteur, il semble que enjambe le fossé entre ici et le genre de la nature humaine. Je demande au peuple de surestimer leur aveugle, compris comme arrogante il?\nL'intelligence humaine et artificielle il peut y avoir une relation plus positive: Avec l'IA faire une meilleure compréhension humaine de leur propre.\n\nAvant de monter dans l'avion, les médias ont mis cette guerre est appelée « bataille finale homme-machine, » Ke Jie a dit qu'il accrochait à la « attitude gagnante et sa détermination à mourir, » une sorte de goût une grande dignité de tous les êtres humains à l'épaule. En fait, Ke Jie n'a pas besoin d'embrouiller, mais cette guerre est plus avancé le cerveau humain et rien showdown du cerveau humain.\nLe premier match a pris fin aujourd'hui, AlphaGo a gagné, mais seulement gagner plus d'un quart de sous-Ke Jie, par rapport aux adversaires de succès de l'an dernier pas de place pour se battre, avec le point de AlphaGo d'aujourd'hui semble impersonnel, semble avoir beaucoup de tolérance, pour produire un illusion de la force humaine comparable. Pourquoi mis à jour AlphaGo mais a gagné seulement un quart comme? Qu'est-ce que cela signifie?\nAlphaGo mise à niveau possible, en gagnant à améliorer, mais le déclin d'échecs, AlphaGo peut avoir été pleinement conscient des échecs de façon Ke Jie, 1/4 est délibérément résultats calculés, peut AlphaGo auto-évolution a eu lieu, entraînant une autre de nouvelles idées d'échecs , ils peuvent trouver Ke Jie Weiqi nouveau ...... mettre pied à terre\nCe sont mes spéculations et de l'imagination, de nouvelles idées pour ce que vous faites?"
    }
}