{
    "dateFormat": "yyyy年MM月dd日",
    "data": {
        "switch": "スイッチ",
        "articleTitle": "AlphaGoは本当に柯傑を獲得したが、なぜ似1/4のですか？",
        "articleContent": "柯傑は期待、失われました。\n圧倒的な記録を与えなければならないの0：ウェイバック12月29日の最後の最後の年に、囲碁AIの男という名前のマスターは、国​​のチェスの都市ゴーゴーとWILDFOX世界のトッププレーヤーとサイト上のゲームの前と後、判明、そして最後に60マスターのライバルは、ネットワークから切断するので生活のダンの質問は、時間だけ引き分けは予想外です。そして、この無敵マスターGoogleは新しいバージョンAlphaGo 2.0 Deepmind人工知能の研究開発チームが実際にあります。\n\n殴ら韓国最初に手を行く李師師1：早くも2016年3月のように、人工知能AlphaGo 4を行かなければなりませんでした。試合前、李師師の自信ゲーム李師師の後、彼はもはやチェスをAlphaGoたいと言っていません。それは冗談だった「唯一の方法のユニフォームマスター（AlphaGo）は電源プラグを抜くことです。」このジョークの後ろに、笑うことは人工知能の深い恐怖です。\n\nしかし、AlphaGoは人の手からで、忘れてはいけません。\n李師師の昨年末の勝利だけでなく、公共KathrineゴーAlphaGoは、少なくともそのコンピューティングパワーとスピードが人間のほこりを作る、非常に高い演奏力に達しています。\n昨年のAlphaGo2.0は、ニューラルネットワークの使用は、人間の脳の神経回路網をシミュレートするだけでなく、スーパーコンピュータを持っており、多くのデータセンターで構成されているノード、各ノード内の複数のスーパーコンピュータとして接続されています。一文であるにまとめ、AlphaGoは、人工知能の統合のための複雑な制御アルゴリズムの品種です。\n\nチェスの複雑さ\nAlphaGo最も基本的なシステムは、畳み込みニューラルネットワーク（畳み込みニューラルネットワーク、CNN）です。移動の法則が交互に黒と白の市松格子片の交点に配置された「チェス側として説明することができるからである。ZI終了後、片を移動させることができない。チェス子のサイズ 『』の周囲に円周間食べること勝者を決定する。「とCNNは、画像を識別するために使用されます。\n\n強化学習の深さ（深Q学習、DQN）モンテカルロツリー検索アルゴリズムの畳み込みニューラルネットワーク認識の高い効率に加えて、（モンテカルロ木検索）アルゴリズムはAlphaGoのコアです。\nモンテカルロ木探索アルゴリズムは、一般的なツリー検索の確率的シミュレーションの精度を組み合わせた企画の形で（移動）問題、ゲーム内のアクションの通常の組み合わせで、最適な意思決定を行うために人工知能の方法です。言葉を使用する勝利の確率を得るために、ダウン最終Lazi、排気までの時間が非常に短い期間内のすべてのケースであるそれぞれが、自身とAlphaGoアナログチェスです。深ニューラルネットワーク値網（バリューネットワーク）とネットワーク戦略（ポリシー・ネットワーク）の両方と、配置することにより、ネットワークを介して、選択されたポイントの多数の値、およびネットワーク選択ポリシーを評価します。\n\nいわゆる強化学習の深さが2000万に対する自己イニング、つまり、自己学習能力など、プレイヤーが対戦いるとの大規模なものを識別するために、AlphaGo 3000万のチェスを学び、覚えておくことができ指し日までこれは、いわゆる「チェスの感覚を、」取得し、迅速碁に状況を判断します。このような行動は大幅木探索の計算量を低減するであろう。\n\nAlphaGo自己のチェスチェスゲーム\nすべてのすべてで、世界のチェスAlphaGo2.0コンピューティングパワーを総なめにした、大きな画像がスーパーであり、人間の心理に影響されないが寒さに金融チェスゲーム、生理学的変化、感情的ではない、唯一の合理的かつ論理的なアルゴリズムの面で発生しました。\nそうであっても、AlphaGoも李師師の手の中にゲーム上に折り畳まれて。柯傑はそれに勝つことができましたの？柯傑今日は、あなたが次のゲーム、視覚的にゼロ確率を獲得したい、ゲームを失ってしまいました。\n\n李師師とAlphaGoチェス第四イニング、AlphaGo抜け穴\nこの時間は、それは深さを考えることで、よりAlphaGo言われて、あなたはまだ旧世代の第四の息子で勝つために何ができるAlphaGoケースを、あなたは知っている、一般的には3人の息子が劣悪レベルに代わって達していたしましょう。柳氏は、この時間はAlphaGoが人間の過去のデータの下に行く必要がありますが、唯一の「強化学習」とアルゴリズムを通じてLaziを決定し、もはや、教師付き学習の出てきたと考えていません。 Googleの公開情報によると、柳氏は、さえも大幅に暴力・コンピューティングを削減、モンテカルロ木探索があきらめることがあり、これはそれはもはや万人30元人間チェスビューローに依存している、AlphaGoは教師あり学習あきらめなかったかもしれないと推測しましたLaziより速く、より高精度。二つは、レコードデータが自己学習チェスを再生する方法をAlphaGoゲーム対戦、そして、ちょうど一週間の時間を集大成の点に達しませんでした。\nAlphaGoも多くのデータと進化はほとんど行くだけでなく、天才の芸術に精通し本物のようなものですAlphaGoので、場所のハードウェアの利点によって占有されている重いコンピューティング、人工知能、上のビットに依存する前であれば。\n\n月に今年、テキサス州の人工知能ポーカーのフィールドも勝利を獲得しました。アルバータ州のIKのコンピュータサイエンス大学のマテイMorav部門は、すべての3000の後にリミットで統計的に有意な10人の11プロのポーカープレイヤーを殴られた、「日はトーナメントホールドされ、AIシステムがDeepStackと呼ばれる開発しました。行くと比べて、テキサスホールデムの未知の成分がより多く、プレイヤーがボードに乗るの情報がいっぱいですが、ポーカーゲームで各プレイヤーは、可能な非対称ゲームプレイ上の限られた情報を持っています。これは、予測可能で再びAIでその進捗状況を示します。\n\nAIは、何度も何度も、進歩我々は助けるが、自己検査を開始することはできません。でもAlphaGo無敵、Goは氷山の唯一の人間の知恵である、我々は現時点で言うことができないはるかヒト人工知能を超えています。しかし、私たちは人間が盲目の迷信を生み出すために順番に知識と知恵の欠如のされているかどうかを振り返り、そして人間の心は、高さを持っていると結論付けてはいけません、それはここに人間性のようなものとのギャップにまたがるようです。私は、彼らのブラインドを過大評価する人を頼むこと傲慢として理解しましたか？\n人間と人工知能より正の関係があるかもしれません：AIでは、独自の更なる人間の理解を作ります。\n\n飛行機に搭乗する前に、メディアはこの戦争と呼ばれる入れている「マンマシン最後の戦い、」柯傑は、彼が肩にすべての人間の味偉大な尊厳の「態度と決意を獲得することは、死ぬために」親切にしがみつきました。実際には、柯傑はもつれする必要はありませんが、この戦争は、より多くのは、人間の脳と人間の脳の対決何も進んでいます。\n今日終わった最初のゲームは、AlphaGoは昨年の今日のAlphaGoのポイントと、反撃する余地を相手にヒットしないと比較して、勝ったが、唯一のサブ柯傑の四半期に勝つ人間味のように見える、生成するために、寛容の多くを得るように思われます人間の強さの錯覚に匹敵。なぜAlphaGoをアップグレードしたが、同様にのみ四半期に勝ちましたか？これは何を意味するのでしょうか？\nAlphaGo可能なアップグレード、改善されますが、チェスの下落受賞;自己進化が起こったAlphaGoも、別の新しいチェスのアイデアが得られ、AlphaGoは1/4が意図的に計算した結果である、道のチェスケ傑を十分に認識されている可能性があり;彼らは柯傑Weiqi新しいディスマウントを見つけることができる......\nこれらは、私の推測と想像している、新しいアイデアは、あなたが何をすべきか？"
    }
}