{
    "data": {
        "switch": "切換",
        "articleTitle": "AlphaGo果然贏了柯潔，但為什麼是1/4子呢？",
        "articleContent": "柯潔輸了，意料之中。\n遙想去年年末12月29日，一個名叫Master的圍棋人工智能橫空出世，前後在弈城圍棋和野狐圍棋網站與各國世界頂尖級選手進行對弈，最後以60:0的壓倒性戰績紛紛讓棋士質疑人生，唯一一次平局也是因為Master對手意外斷開網絡連接。而這個所向披靡的Master其實就是Google人工智能團隊Deepmind研發的AlphaGo新版本2.0。\n\n早在2016年3月，圍棋人工智能AlphaGo就已經以4:1戰勝過韓國第一圍棋手李世石。比賽之前，李世石信心百倍，比賽之後，李世石說，他再也不想跟AlphaGo下棋了。有人開玩笑，“制服Master（AlphaGo）的唯一一個方法就是拔開電源”。啞然失笑，這個笑話的背後是對人工智能深深地恐懼。\n\n然而，不要忘了，AlphaGo是出自人類之手。\n去年年末戰胜李世石以及一眾圍棋聖手的AlphaGo已經達到相當高的棋力，至少其計算能力和速度讓人類望塵莫及。\n去年的AlphaGo2.0，運用的神經網絡系統模擬人腦的神經網絡，已經不僅是一台超級計算機，而且是由許多個數據中心作為節點相連，每個節點內有多台超級計算機。一句話來概括就是，AlphaGo是集多種複雜的控制、算法為一體的人工智能。\n\n圍棋的複雜程度\nAlphaGo最基本的系統是卷積神經網絡 (Convolutional Neural Network, CNN)。由於圍棋的規律可描述為“對弈雙方在棋盤網格的交叉點上交替放置黑色和白色的棋子。落子完畢後，棋子不能移動。對弈過程中圍地吃子，以所圍'地'的大小決定勝負。”而CNN則是用來識別圖像。\n\n除了高效率識別的捲積神經網絡，深度強化學習 (Deep Q-Learning, DQN)和蒙特卡洛樹搜索算法 (Monte Carlo Tree Search)也是AlphaGo的核心算法。\n蒙特卡洛樹搜索算法是一種人工智能問題中做出最優決策的方法，一般是在組合博弈中的行動（move）規劃形式，它結合了隨機模擬的一般性和樹搜索的準確性。用人話來說就是，AlphaGo模擬自己與自己對弈，每一種落子都下到終局，在非常短的時間裡窮盡所有情況，從而取得獲勝概率。借助值網絡（value network）與策略網絡（policy network）這兩種深度神經網絡，通過值網絡來評估大量選點，並通過策略網絡選擇落點。\n\n所謂的深度強化學習就是指AlphaGo能夠記住和學習3000萬人類的棋譜，從而識別出與之對戰的棋手的路數，其中包括了自主學習的能力，也就是每天自我對陣2000萬局，以此獲得所謂的“棋感”，以及在比賽中快速判斷圍棋的局勢。這樣一來就大大減少了樹搜索的計算量。\n\nAlphaGo自我對弈棋局\n總而言之，橫掃世界棋壇的AlphaGo2.0計算能力、大局觀都超強，且不會受到絲毫人類棋士在對弈比賽中發生的心理、生理變化的影響，沒有感性，只有理性到冷酷的算法和邏輯。\n即使如此，AlphaGo也曾經在李世石的手中折過一局。那柯潔有可能贏嗎？柯潔今天已經輸了一局，想要在接下來的比賽中勝出，目測概率為零。\n\n李世石與AlphaGo對弈第四局，AlphaGo出現漏洞\n這一次，據說AlphaGo的棋力更增，可以做到在讓前代AlphaGo四子的情況下仍然獲勝，要知道，通常來講讓三子就已經達到代差級別。王小川認為，這一次的AlphaGo已經擺脫了監督學習，不再需要人類下圍棋的歷史數據，而是只通過“增強學習”和算法確定落子。根據Google公開資料，王小川推測，此次A​​lphaGo可能已經放棄了監督學習，也就是說不再依賴原先人類的3000萬局棋譜，甚至有可能放棄了蒙特卡洛樹搜索，大大減少了暴力計算，落子速度更快、準確率更高。兩台沒有棋譜數據的AlphaGo自我對戰學習如何下棋，並達到登峰造極的地步，只需要一周的時間。\n如果說之前的AlphaGo還依賴於大量的數據、略有點笨重的計算，這是人工智能佔據了硬件優勢的地利，那麼進化後的AlphaGo幾乎就像是一個真正深諳圍棋藝術的天才。\n\n就在今年3月，人工智能在德州撲克領域也獲得了全勝。加拿大阿爾伯塔大學計算機系的Matej Morav ík研發了一個被稱為DeepStack的AI系統，它在每3000次無限德州撲克比賽后，具有統計意義地打敗了11名職業撲克選手中的10名。相比於圍棋，德州撲克的未知成分更多，在棋盤上棋手獲得的是完全信息，但是在撲克遊戲中每個玩家對可能的玩法有不對稱的有限信息。這預示著AI在預測性上又一次進步。\n\n人工智能一次又一次的進步，不禁讓我們開始自我反省。即使AlphaGo打遍天下無敵手，圍棋也只是人類智慧的一角，我們遠不能說目前的人工智能超越了人類。然而，我們應該反思，是否一直以來人類因為對自己的智慧認識不足而反過來產生盲目的迷信，斷定人類思維具有不可及的高度，似乎這裡有種本質的鴻溝橫亙與人機之間。我可否將人對自己的盲目高估，理解為一種傲慢呢？\n人與人工智能也許存在一種更積極的關係：通過AI讓人類進一步地認識自己。\n\n出征前，媒體們把此戰稱為“人機最後的決戰”，柯潔說他抱著“必勝的態度，必死的決心”，大有一種肩負起全人類尊嚴的味道。其實柯潔無需糾結，這一戰不過是人腦與更先進的人腦的對決罷了。\n而今天第一局結束，AlphaGo贏了，卻只險勝了柯潔1/4子，對比去年打到對手毫無反擊餘地，今天的AlphaGo顯得有了點人情味，似乎變得寬容許多，產生一種人機實力不相上下的錯覺。為什麼升級過的AlphaGo反而只贏了1/4子呢？這意味著什麼？\n可能AlphaGo升級了，勝率提高，但是棋力下降；可能AlphaGo已經完全了解了柯潔的棋路，1/4是有意計算出來的結果；可能AlphaGo發生了自我進化，產生另一種新的下棋思路；可能柯潔發現了圍棋新下法……\n以上是我的猜測和想像，你們有啥新觀點呢？"
    }
}